Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.UpdateLevels
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.OnEditType
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.IsEditTypeEnabled
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetLevelIds
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetLevelNames
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.SetSelectedLevelIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetViewTypeIds
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetViewTypeNames
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetViewScaleStrings
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.GetViewScales
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.SelectedViewTypeIndex
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.DefaultViewScaleIndex
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.ViewScale
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.BShowViewScaleDropdown
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.BDoNotDuplicate
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.EViewType
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.DialogOptions.NewPlanViewDialog.ePlanViewType,System.Boolean,System.String,System.UInt32,System.String)
constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewPlanViewDialogOptions
The specific class for New Drafting View dialog options as the input for ModalDialogCallEventArgs.
Since:
2027